Revit 2021.1 API
PathOfTravelCalculationRequestType Enumeration
 An enumerated type containing possible requests for the Path of Travel calculation.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2020
Since: 2020
Syntax
C#
[ObsoleteAttribute("This type is deprecated in Revit 2021 and will be removed in the next version of Revit. For internal use only and no code should be referencing it.")]
public enum PathOfTravelCalculationRequestType
Visual Basic
<ObsoleteAttribute("This type is deprecated in Revit 2021 and will be removed in the next version of Revit. For internal use only and no code should be referencing it.")> _
Public Enumeration PathOfTravelCalculationRequestType
Visual C++
[ObsoleteAttribute(L"This type is deprecated in Revit 2021 and will be removed in the next version of Revit. For internal use only and no code should be referencing it.")]
public enum class PathOfTravelCalculationRequestType
Members
Member name | Description
CalculateForCorrespondingStartEndPairs |  Calculate paths of travel between corresponding pairs of start and end points.
CalculateForAllPossibleStartEndPairs |  Calculate paths of travel between all possible pairs of start and end points.
CalculateFarthestPointsToMultipleDestinations |  Calculate points with farthest distance to the closest of given destinations.
GetRevealObstaclesModeInView |  Determine if reveal obstacles mode is on or off in the view.
SetRevealObstaclesModeInView |  Sets reveal obstacles mode in the view.
LockCache |  Lock changes to internal caches
UnlockCache |  Allow changes to internal caches
CalculateForPathsWithWaypoints |  Calculate paths of travel between corresponding pairs of start and end points with possible intermediate waypoints.
GetDistanceMapModeInView |  Determine if distance map mode is on or off in the view.
SetDistanceMapModeInView |  Sets distance map mode in the view.
CalculateShortestPathsToMultipleDestinations |  Calculate paths from given start points to the closest of given destinations.
See Also
Autodesk.Revit.DB.Analysis Namespace